
from setuptools import setup

setup(
    name='nemtpy',
    version='0.1.1',
    description='nemtpy: Библиотека для скоростной обработки массивов!Библиотека для скоростной обработки массивов данных. Используя библиотеку `nemtpy`, вы можете заменить популярные решения, такие как NumPy, Pandas и SciPy',
    long_description='nemtpy - это мощная библиотека, разработанная компанией NemtyrevAI, которая предоставляет эффективные инструменты для хранения, обработки и анализа массивов данных различных типов. Библиотека написана на C++ и предоставляет питонический интерфейс для удобного использования из Python. Так-же предоставляет мощные инструменты для создания и обучения искусственного интеллекта (ИИ). Библиотека специально разработана для облегчения процесса разработки ИИ-систем и предлагает широкий набор функций и высокоуровневых абстракций, позволяющих создать и обучить простые ИИ-моделиИспользуя библиотеку `nemtpy`, вы можете заменить популярные решения, такие как NumPy, Pandas и SciPy. nemtpy это мощная библиотека, разработанная  NemtyrevAI, которая предоставляет эффективные инструменты для хранения, обработки и анализа массивов данных различных типов. Библиотека написана на C++ и предоставляет питонический интерфейс для удобного использования из Python.',
    author='Немтырев Алексей Валерьевич (NemtyrevAI)',
    author_email='art.net82@gmail.com',
    license='LICENSE',
    packages=['nemtpy'],
    classifiers=[
        'Development Status :: 3 - Alpha',
        'License :: OSI Approved :: MIT License',
        'Programming Language :: Python :: 3',
        'Programming Language :: Python :: 3.6',
        'Programming Language :: Python :: 3.7',
        'Programming Language :: Python :: 3.8',
    ],
    keywords='numpy',

    install_requires=[
        '',
    ],
)
